---
kind: method
id: M:Autodesk.Revit.DB.ScheduleDefinition.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
source: html/38e0bbe3-61fe-5565-bf74-96089108e2ee.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.IsValidCombinedParameters Method

Checks if data is valid for combined parameters

## Syntax (C#)
```csharp
public bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
```

## Parameters
- **data** (`System.Collections.Generic.IList < TableCellCombinedParameterData >`) - data is array of TableCellCombinedParameterData to be set as combined parameters

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null